{
  "name": "__POLICY_NAME__",
  "description": "ASR Policy - Hardened Block Mode",
  "platforms": "windows10",
  "technologies": "mdm,microsoftSense",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "5BEB7EFE-FD9A-4556-801D-275E5FFC04CC,C1DB55AB-C21A-4637-BB3F-A12568109D35,01443614-CD74-433A-B99E-2ECDC07BFC25,26190899-1602-49E8-8B27-EB1D0A1CE869,D4F940AB-401B-4EFC-AADC-AD5F3C50688A,7674BA52-37EB-4A4F-A9A1-F0F9A1619A2C,9E6C4E1F-7D60-472F-BA1A-A39EF669E4B2,D3E037E1-3EB8-44C8-A917-57927947596D,B2B3F03D-6A65-4F7B-A9C7-1C7EF74A9BA4,E6DB77E5-3DF2-4CF1-B95A-636979351E5B,92E97FA1-2EDF-4476-BDD6-9DD0B4DDDC7B,56A863A9-875E-4185-98A7-B882C64B5CE5,D1E49AAC-8F56-4280-B9BA-993A6D77406C,3B576869-A4EC-4529-8536-B80A7769E899,75668C1F-73B5-4CF0-BB93-3ECF5CB7CC84,BE9BA2D9-53EA-4CDC-84E5-9B1EEEE46550"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "0"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablecontrolledfolderaccess",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "0"
        }
      }
    }
  ]
}
