{
  "name": "Windows Endpoint Detection and Response Policy Endpoints",
  "description": "This policy is to be assigned to Device groups for Windows Endpoints for Onboarding Into Defender for Endpoint. This also sends telemetry to Defender for vulnerability management and signaling.",
  "platforms": "windows10",
  "technologies": "mdm,microsoftSense",
  "roleScopeTagIds": [
    "0"
  ],
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
        "auditRuleInformation": null,
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "23ab0ea3-1b12-429a-8ed0-7390cf699160"
        },
        "choiceSettingValue": {
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "e5c7c98c-c854-4140-836e-bd22db59d651",
            "useTemplateDefault": false
          },
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector",
              "settingInstanceTemplateReference": null,
              "auditRuleInformation": null,
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                "settingValueTemplateReference": null,
                "value": "df923790-6338-477b-99a7-0ce3286569b4",
                "valueState": "encryptedValueToken"
              }
            }
          ]
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
        "auditRuleInformation": null,
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6998c81e-2814-4f5e-b492-a6159128a97b"
        },
        "choiceSettingValue": {
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "f72c326c-7c5b-4224-b890-0b9b54522bd9",
            "useTemplateDefault": false
          },
          "children": []
        }
      }
    }
  ],
  "templateReference": {
    "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
    "templateFamily": "endpointSecurityEndpointDetectionAndResponse",
    "templateDisplayName": "Endpoint detection and response",
    "templateDisplayVersion": "Version 1"
  }
}

